Autodesk.Revit.DB.Edge.GetCurveUV(System.Int32,Autodesk.Revit.DB.Transform2D)
Calculate and transform a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces.
The output curve's direction will follow the parametric direction of the edge, not the topological
direction of the edge on the given face.
Remarks: Use of this function is preferred over using GetCurveUV(int index) and then transforming the curve, as the latter approach may yield a less accurate result.
index: The index of the face (0 or 1).
transform: Transformation to apply to the curve.
Returns: If successful, returns the calculated and transformed CurveUV, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the specified index is not 0 or 1.
Since: 2021

Autodesk.Revit.DB.Edge.GetCurveUV(System.Int32)
Calculate a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces.
The output curve's direction will follow the parametric direction of the edge, not the topological
direction of the edge on the given face.
index: The index of the face (0 or 1).
Returns: If successful, returns the calculated CurveUV, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the specified index is not 0 or 1.
Since: 2021

Autodesk.Revit.DB.Edge.IsFlippedOnFace(Autodesk.Revit.DB.Face)
Determines if this edge's topological direction on the Face is opposite to its parametric direction.
face: The face with respect to which the direction is considered. Must belong to the edge.
Remarks: Outer edge loops on a Face are oriented counter-clockwise with respect to the Face's orientation,
and inner loops are oriented clockwise. The topological direction of an edge on a face means the direction
in which the edge's loop is being traversed.
Returns: true if this edge's topological direction on the Face is opposite to its parametric direction, false if the topological direction agrees with the parametric direction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified face is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified face is not one of the faces for this edge.
Since: 2021

Autodesk.Revit.DB.Edge.IsFlippedOnFace(System.Int32)
Determines if this edge's topological direction on the Face is opposite to its parametric direction.
index: The index of the face (0 or 1).
Remarks: Outer edge loops on a Face are oriented counter-clockwise with respect to the Face's orientation,
and inner loops are oriented clockwise. The topological direction of an edge on a face means the direction
in which the edge's loop is being traversed.
Returns: true if this edge's topological direction on the Face is opposite to its parametric direction, false if the topological direction agrees with the parametric direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the specified index is not 0 or 1.
Since: 2021